micahjp5158/stm32-projects/stm32f407vg/registers/nvic_registers.h

/*
 * nvic_registers.h
 *
 * Defines the NVIC register addresses
 */

#ifndef NVIC_REGISTERS_H
#define NVIC_REGISTERS_H

/* NVIC register addresses from Arm Cortex-M4 technical manual, Table 6-1*/
#define ICTR        0xE000E004

#define NVIC_ISER0  0xE000E100
#define NVIC_ISER1  0xE000E104
#define NVIC_ISER2  0xE000E108
#define NVIC_ISER3  0xE000E10C
#define NVIC_ISER4  0xE000E110
#define NVIC_ISER5  0xE000E114
#define NVIC_ISER6  0xE000E118
#define NVIC_ISER7  0xE000E11C

#define NVIC_ICER0  0xE000E180
#define NVIC_ICER1  0xE000E184
#define NVIC_ICER2  0xE000E188
#define NVIC_ICER3  0xE000E18C
#define NVIC_ICER4  0xE000E190
#define NVIC_ICER5  0xE000E194
#define NVIC_ICER6  0xE000E198
#define NVIC_ICER7  0xE000E19C

#define NVIC_ISPR0  0xE000E200
#define NVIC_ISPR1  0xE000E204
#define NVIC_ISPR2  0xE000E208
#define NVIC_ISPR3  0xE000E20C
#define NVIC_ISPR4  0xE000E210
#define NVIC_ISPR5  0xE000E214
#define NVIC_ISPR6  0xE000E218
#define NVIC_ISPR7  0xE000E21C

#define NVIC_ICPR0  0xE000E280
#define NVIC_ICPR1  0xE000E284
#define NVIC_ICPR2  0xE000E288
#define NVIC_ICPR3  0xE000E28C
#define NVIC_ICPR4  0xE000E290
#define NVIC_ICPR5  0xE000E294
#define NVIC_ICPR6  0xE000E298
#define NVIC_ICPR7  0xE000E29C

#define NVIC_IABR0  0xE000E300
#define NVIC_IABR1  0xE000E304
#define NVIC_IABR2  0xE000E308
#define NVIC_IABR3  0xE000E30C
#define NVIC_IABR4  0xE000E310
#define NVIC_IABR5  0xE000E314
#define NVIC_IABR6  0xE000E318
#define NVIC_IABR7  0xE000E31C

#define NVIC_IPR0   0xE000E400
#define NVIC_IPR1   0xE000E404
#define NVIC_IPR2   0xE000E408
#define NVIC_IPR3   0xE000E40C
#define NVIC_IPR4   0xE000E410
#define NVIC_IPR5   0xE000E414
#define NVIC_IPR6   0xE000E418
#define NVIC_IPR7   0xE000E41C
#define NVIC_IPR8   0xE000E420
#define NVIC_IPR9   0xE000E424
#define NVIC_IPR10  0xE000E428
#define NVIC_IPR11  0xE000E42C
#define NVIC_IPR12  0xE000E430
#define NVIC_IPR13  0xE000E434
#define NVIC_IPR14  0xE000E438
#define NVIC_IPR15  0xE000E43C
#define NVIC_IPR16  0xE000E440
#define NVIC_IPR17  0xE000E444
#define NVIC_IPR18  0xE000E448
#define NVIC_IPR19  0xE000E44C
#define NVIC_IPR20  0xE000E450
#define NVIC_IPR21  0xE000E454
#define NVIC_IPR22  0xE000E458
#define NVIC_IPR23  0xE000E45C
#define NVIC_IPR24  0xE000E460
#define NVIC_IPR25  0xE000E464
#define NVIC_IPR26  0xE000E468
#define NVIC_IPR27  0xE000E46C
#define NVIC_IPR28  0xE000E470
#define NVIC_IPR29  0xE000E474
#define NVIC_IPR30  0xE000E478
#define NVIC_IPR31  0xE000E47C
#define NVIC_IPR32  0xE000E480
#define NVIC_IPR33  0xE000E484
#define NVIC_IPR34  0xE000E488
#define NVIC_IPR35  0xE000E48C
#define NVIC_IPR36  0xE000E490
#define NVIC_IPR37  0xE000E494
#define NVIC_IPR38  0xE000E498
#define NVIC_IPR39  0xE000E49C
#define NVIC_IPR40  0xE000E4A0
#define NVIC_IPR41  0xE000E4A4
#define NVIC_IPR42  0xE000E4A8
#define NVIC_IPR43  0xE000E4AC
#define NVIC_IPR44  0xE000E4B0
#define NVIC_IPR45  0xE000E4B4
#define NVIC_IPR46  0xE000E4B8
#define NVIC_IPR47  0xE000E4BC
#define NVIC_IPR48  0xE000E4C0
#define NVIC_IPR49  0xE000E4C4
#define NVIC_IPR50  0xE000E4C8
#define NVIC_IPR51  0xE000E4CC
#define NVIC_IPR52  0xE000E4D0
#define NVIC_IPR53  0xE000E4D4
#define NVIC_IPR54  0xE000E4D8
#define NVIC_IPR55  0xE000E4DC
#define NVIC_IPR56  0xE000E4E0
#define NVIC_IPR57  0xE000E4E4
#define NVIC_IPR58  0xE000E4E8
#define NVIC_IPR59  0xE000E4EC

#endif // NVIC_REGISTERS_H
